[구글 코랩(Colab)에서 실행하기](https://colab.research.google.com/github/lovedlim/bigdata_analyst_cert/blob/main/part1/ch2/ch2_pandas.ipynb)

# 판다스

## Section1. 데이터프레임과 시리즈

In [ ]:
print("hello")

In [2]:
# 판다스 라이브러리 불러오기
import pandas as pd
# 판다스 데이터는 시리즈와 데이터프레임으로 구성된다.
# Series는 1차원 형태이고, DataFrame은 행과 열이 있는 2차원 형태다.
# 판다스에서 축(axis)을 숫자로 나타낼 때 행은 0, 열은 1로 표시한다. = "행(0)렬(1)"

In [2]:
# 시리즈 만들기 (문자열) - Object형은 주로 문자열 데이터를 나타내는 데 사용된다.
menu = pd.Series(['비빔밥', '김치찌개', '된장찌개'])
menu

0     비빔밥
1    김치찌개
2    된장찌개
dtype: object

In [3]:
# 시리즈 만들기(정수형)
# 판다스는 리스트에 포함된 데이터 타입을 기반으로 시리즈의 데이터 타입을 자동으로 결정한다.
price = pd.Series([10000, 9000, 8000])
price

0    10000
1     9000
2     8000
dtype: int64

In [4]:
# 데이터 프레임 만들기 pd.DataFrame({"컬럼명":데이터})
pd.DataFrame({
    "menu" : menu,
    "price" : price
})

   menu  price
0   비빔밥  10000
1  김치찌개   9000
2  된장찌개   8000

In [5]:
# 데이터 프레임 만들기 pd.DataFrame({"컬럼명":데이터})
df = pd.DataFrame({
    "메뉴":['비빔밥', '김치찌게', '된장찌게'],
    "가격":[10000, 9000, 8000],
    "원산지":['국내산', '국내산', '국내산']
})
df

     메뉴     가격  원산지
0   비빔밥  10000  국내산
1  김치찌게   9000  국내산
2  된장찌게   8000  국내산

In [6]:
# 시리즈로 선택 (가격)
# 1개의 컬럼명만 선택하면 시리즈 형태로 출력한다.
df['메뉴']

0     비빔밥
1    김치찌게
2    된장찌게
Name: 메뉴, dtype: object

In [7]:
# 데이터프레임으로 선택 (가격)
# 1개의 컬럼을 시리즈가 아닌 데이터프레임으로 만드려면 대괄호로 한 번 더 묶어준다.
df[['메뉴']]

     메뉴
0   비빔밥
1  김치찌게
2  된장찌게

In [8]:
# 복수의 컬럼 선택 = 데이터프레임 자료형
df[['메뉴', '가격']]

     메뉴     가격
0   비빔밥  10000
1  김치찌게   9000
2  된장찌게   8000

In [9]:
# 데이터프레임 선택 (가격)
# 컬럼을 복수로 선택할 때는 주로 리스트를 활용한다.
cols = ['메뉴', '가격']
df[cols]

     메뉴     가격
0   비빔밥  10000
1  김치찌게   9000
2  된장찌게   8000

In [10]:
# 데이터 프레임 type 확인
print("df          : ", type(df))
print("df['가격']   : ", type(df['가격']))
print("df[['가격']] : ", type(df[['가격']]))

df          :  <class 'pandas.core.frame.DataFrame'>
df['가격']   :  <class 'pandas.core.series.Series'>
df[['가격']] :  <class 'pandas.core.frame.DataFrame'>

## Section2. 데이터 저장 및 불러오기

In [11]:
# 데이터 준비
df = pd.DataFrame({
    "메뉴":['아메리카노', '카페라떼', '카페모카', '카푸치노', '에스프레소', '밀크티', '녹차'],
    "가격":[4500, 5000, 5500, 5000, 4000, 5900, 5300],
    "칼로리":[10, 110, 250, 110, 20, 210, 0],
})
df

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

In [12]:
df.to_csv('temp.csv')

In [13]:
# Unnamed: 0 컬럼은 데이터를 저장할 때 기본 설정으로 기존 인덱스가 값으로 함께 저장된 것이다.
# 가장 왼쪽에 있는 인덱스는 pd.read_csv()로 데이터를 불러올 때 새로 생성된 인덱스다.
temp_df = pd.read_csv('temp.csv')
temp_df.head()

   Unnamed: 0     메뉴    가격  칼로리
0           0  아메리카노  4500   10
1           1   카페라떼  5000  110
2           2   카페모카  5500  250
3           3   카푸치노  5000  110
4           4  에스프레소  4000   20

In [14]:
# 데이터 불러오기
# 인덱스를 제외하고 저장하기 위해 index=false로 설정한다.(필수!)
df.to_csv('cafe.csv', index=False)
df = pd.read_csv('cafe.csv')
df.head()

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20

In [15]:
# 데이터 불러오기 옵션
# 1.index_col : 인덱스로 사용할 컬럼명 또는 열의 번호를 지정할 수 있음
# pd.read_csv('data.csv', index_col='컬럼명')
# pd.read_csv('data.csv', index_col=0)

# 2.usecols : 불러올 컬럼명 또는 열의 번호를 지정
pd.read_csv('cafe.csv', usecols=['메뉴', '가격']) 

# 3.parse_dates : 데이터를 불러올 때, 문자열로 된 컬럼을 날짜 datetime으로 파싱함
# pd.read_csv('data.csv', parse_dates=['컬럼명'])

# 4.encoding : 판다스는 utf-8을 기본 인코딩 방식으로 사용한다. 인코딩 방식을 변경할 수 있다.
# pd.read_csv('data.csv', encoding='cp949')
# pd.read_csv('data.csv', encoding='euc-kr')

      메뉴    가격
0  아메리카노  4500
1   카페라떼  5000
2   카페모카  5500
3   카푸치노  5000
4  에스프레소  4000
5    밀크티  5900
6     녹차  5300

## Section3. 탐색적 데이터 분석(EDA)

EDA는 데이터를 탐색하고 이해하기 위해 수행한다. 데이터를 다양한 각도에서 관찰하고 이해하자.
결측치, 이상치, 패턴, 변수 파악 등 데이터 전처리를 하기 전에 데이터에 대한 이해를 돕는 중요한 단계다.

In [16]:
# 데이터 샘플 확인: 앞에서 부터 N개 (기본 5개)
df.head(2)

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110

In [17]:
# 데이터 샘플 확인: 뒤에서 부터 N개 (기본 5개)
df.tail(3)

      메뉴    가격  칼로리
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

In [22]:
# 데이터 샘플 확인: 임의로 샘플링해 N개의 행을 반환 (기본 1개)
# 실행할 때마다 다른 결과를 샘플링해 보여준다.
df.sample()

     메뉴    가격  칼로리
3  카푸치노  5000  110

In [23]:
# 데이터 프레임 크기 (행, 컬럼)
# 주의) 뒤에 괄호가 없다.
# shape는 데이터프레임의 속성이어서 괄호가 없고, head(), tail() 등은 함수 형태라서 괄호가 존재한다.
df.shape

(7, 3)

In [24]:
# 컬럼 형태(type)
# 데이터프레임 안 컬럼의 자료형을 확인한다.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int64
 2   칼로리     7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

### 상관 관계

상관관계를 확인할 수 있다. 가격과 칼로리는 0.7의 양의 상관 관계를 가진다.

데이터프레임에 숫자형과 문자형 컬럼이 혼합되어 있을 때 corr(), mean(), sum() 같은 함수를 사용하면 에러가 발생한다.
- ValueError : 문자열 데이터를 숫자로 변환할 수 없음

따라서 해당 함수에 numeric_only=True 옵션을 추가해주어야 한다.

시험 환경은 낮은 판다스 버전이기 때문에 설정이 따로 필요없다!

In [25]:
# 상관관계 corr
df.corr(numeric_only=True)

           가격       칼로리
가격   1.000000  0.713227
칼로리  0.713227  1.000000

### 범주형 데이터 탐색

In [26]:
# 중복 값이 있는 데이터 생성
df_car = pd.DataFrame({
    "car":['Sedan','SUV','Sedan','SUV','SUV','SUV','Sedan','Sedan','Sedan','Sedan','Sedan'],
    "size":['S','M','S','S','M','M','L','S','S', 'M','S']
})
df_car.head(3)

     car size
0  Sedan    S
1    SUV    M
2  Sedan    S

In [27]:
# 항목 종류 수 nunique()
# 데이터프레임에서 컬럼별로 고유한 값의 개수를 찾는다.
df_car.nunique()

car     2
size    3
dtype: int64

In [28]:
# 항목 종류
# 구체적인 항목을 파악할 수 있다.
print(df_car['car'].unique())
print(df_car['size'].unique())

['Sedan' 'SUV']
['S' 'M' 'L']

In [29]:
# 항목별 개수(중요)
# 주로 시리즈(데이터프레임 특정 컬럼)에 적용하여 많이 사용한다.
print(df_car['car'].value_counts())
print(df_car['size'].value_counts())

car
Sedan    7
SUV      4
Name: count, dtype: int64
size
S    6
M    4
L    1
Name: count, dtype: int64

### 기술통계

**수치형 데이터**
- count: 값이 있는 데이터 수
- mean
- std: 표준편차
- min
- 00%: 백분위수에서 00%
- max

**object 자료형**
- count: 값이 있는 데이터 수
- unique: 고유한 데이터 수(종류)
- top: 최빈값
- freq: 가장 많이 나오는 값의 빈도 수

In [30]:
# 데이터의 기술 통계량
# 기본적으로 수치형 데이터(int, float 등)만 기본적으로 적용해 기술통계 결과를 확인할 수 있다.
df.describe()

                가격         칼로리
count     7.000000    7.000000
mean   5028.571429  101.428571
std     631.702160   99.402980
min    4000.000000    0.000000
25%    4750.000000   15.000000
50%    5000.000000  110.000000
75%    5400.000000  160.000000
max    5900.000000  250.000000

In [32]:
# 데이터 타입이 object인 기술 통계
df_car.describe(include="object")

          car size
count      11   11
unique      2    3
top     Sedan    S
freq        7    6

In [33]:
df.describe(include="O")

           메뉴
count       7
unique      7
top     아메리카노
freq        1

## Section4. 자료형 변환

In [34]:
# 데이터 준비
data = {
    "메뉴":['아메리카노', '카페라떼', '카페모카', '카푸치노', '에스프레소', '밀크티', '녹차'],
    "가격":[4500.0, 5000.0, 5500.0, 5000.0, 4000.0, 5900.0, 5300.0],
    "칼로리":['10', '110', '250', '110', '20', '210', '0'],
}
df = pd.DataFrame(data)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      float64
 2   칼로리     7 non-null      object
dtypes: float64(1), object(2)
memory usage: 300.0+ bytes

In [35]:
# 자료형 변환 / astype /  object -> int
df['가격'] = df['가격'].astype('int')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int32
 2   칼로리     7 non-null      object
dtypes: int32(1), object(2)
memory usage: 272.0+ bytes

In [36]:
df['칼로리'] = df['칼로리'].astype('float')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int32
 2   칼로리     7 non-null      float64
dtypes: float64(1), int32(1), object(1)
memory usage: 272.0+ bytes

## Section5. 새로운 컬럼 추가

In [37]:
df = pd.read_csv('cafe.csv')
df.head(2)

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110

In [38]:
# 새로운 컬럼 추가 (값은 0)
df['new'] = 0
df.head(2)

      메뉴    가격  칼로리  new
0  아메리카노  4500   10    0
1   카페라떼  5000  110    0

In [39]:
# 할인가 컬럼 추가
discount = 0.2
df['할인가'] = df['가격'] * (1-discount)
df.head(2)

      메뉴    가격  칼로리  new     할인가
0  아메리카노  4500   10    0  3600.0
1   카페라떼  5000  110    0  4000.0

## Section6. 데이터 삭제 (컬럼, 행)

In [48]:
df = pd.read_csv('cafe.csv')
df.head(3)

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250

### 행 삭제

In [49]:
# 행 삭제
# inplace=True를 설정해 drop 결과값을 자동 저장한다.
# 삭제 전후로 데이터 크기를 확인하는 것을 추천한다.
print(df.shape)
df.drop(1, axis=0, inplace=True)

print(df.shape)
df.head(3)

(7, 3)
(6, 3)

      메뉴    가격  칼로리
0  아메리카노  4500   10
2   카페모카  5500  250
3   카푸치노  5000  110

### 컬럼 삭제

In [42]:
# 데이터 삭제
# axis=0:행방향, axis=1:열방향(컬럼)
df = df.drop('칼로리', axis=1)
df.head(3)

      메뉴    가격
0  아메리카노  4500
2   카페모카  5500
3   카푸치노  5000

## Section7. 인덱싱/슬라이싱(loc)
- 인덱스 명
- 인덱스 명(범위), 컬럼 명(범위)

loc는 location의 약자로 인덱스명 또는 컬럼명을 통해 데이터에 접근한다. 즉 df.loc[인덱스명]을 통해 해당 인덱스 데이터에 접근할 수 있다. 이때 인덱스명이 숫자인 경우에는 그대로 작성하고, 인덱스명이 문자(loc['문자'])인 경우에는 작은따옴표 또는 큰따옴표로 묶어야 한다.

In [50]:
# 데이터 불러오기
df = pd.read_csv('cafe.csv')
df.head(2)

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110

In [56]:
# 인덱싱 (행 전체)
# 아메리카노
df.loc[0]

메뉴     아메리카노
가격      4500
칼로리       10
Name: 0, dtype: object

In [57]:
# 카페라떼 가격 = 인덱스명이 1인 행과 컬럼명이 가격인 값
# 특정 행과 특정 컬럼(열)의 교차점에 있는 단일 값을 출력
df.loc[1, "가격"]

5000

In [58]:
# 슬라이싱 (컬럼 전체)
# 가격
df.loc[:, "가격"]

0    4500
1    5000
2    5500
3    5000
4    4000
5    5900
6    5300
Name: 가격, dtype: int64

In [ ]:
# 슬라이싱
df.loc[2, '메뉴':'칼로리']

In [ ]:
# 슬라이싱
# 카페모카 메뉴와 칼로리
df.loc[2, ['메뉴', '칼로리']]

In [ ]:
# 슬라이싱
df.loc[1:3, '메뉴':'가격']

## Section8. 인덱싱/슬라이싱(iloc)
- 인덱스 번호
- 인덱스 번호(범위), 컬럼 번호(범위)

loc에서 대괄호 안의 0은 인덱스명을 의미하기 때문에 순서가 변경되더라도 아메리카노의 인덱스명이 0이면 아메리카노 데이터를 인덱싱한다. 하지만 iloc에서 대괄호 안의 0은 순서를 의미한다. 그래서 0은 첫 번째 행(또는 컬럼), 1은 두 번째 행(또는 컬럼)을 의미한다.

In [3]:
# 데이터 불러오기
df = pd.read_csv('cafe.csv')
df.drop(0, axis=0, inplace=True) # 첫번째 행 삭제
df.head(2)

     메뉴    가격  칼로리
1  카페라떼  5000  110
2  카페모카  5500  250

In [ ]:
# 인덱싱 (행 전체)
# 인덱스 0번은 삭제되어 존재하지 않지만, iloc에서는 0번째 순서인 첫 번째 행을 출력한다.
# 카페라떼
df.iloc[0]

In [ ]:
# 슬라이싱 (컬럼 전체)
# 1번 열에 대해 전체 값을 출력한다.
# 가격
df.iloc[:, 1]

In [ ]:
# 슬라이싱
# 카페모카 메뉴와 가격
# iloc는 끝 인덱스를 포함하지 않는다. 즉 0,1번 열만 출력된다.
df.iloc[2, 0:2]

In [ ]:
# 슬라이싱 (카페라떼와 카페모카의 전체 데이터)
# iloc 대괄호 안에 범위가 1개만 있다면 행 인덱스 범위다.
df.iloc[1:3]

In [ ]:
df.loc[2:3,'메뉴':'칼로리']

## Section9. 데이터 추가/변경

In [4]:
# 데이터 불러오기
df = pd.read_csv('cafe.csv')
df.head(2)

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110

In [5]:
# 결측값으로 추가, 원두 컬럼을 만들고 결측값(NaN)으로 대입
import numpy as np
df['원산지'] = np.nan
df.head(4)

      메뉴    가격  칼로리  원산지
0  아메리카노  4500   10  NaN
1   카페라떼  5000  110  NaN
2   카페모카  5500  250  NaN
3   카푸치노  5000  110  NaN

In [6]:
# 아메리카노의 원두는 '콜롬비아' 데이터 추가
df.loc[0, "원산지"] = '콜롬비아'
df.loc[2:3, "원산지"] = '과테말라'
df.head(4)

      메뉴    가격  칼로리   원산지
0  아메리카노  4500   10  콜롬비아
1   카페라떼  5000  110   NaN
2   카페모카  5500  250  과테말라
3   카푸치노  5000  110  과테말라

In [7]:
# 리스트 형태로 데이터(행) 추가
# 반드시 행의 컬럼 수와 리스트의 데이터 수가 일치해야 한다.
# 인덱스명은 숫자가 아닌 문자도 가능하다.
df.loc['시즌'] = ['크리스마스라떼', 6000, 300, '한국']
df.tail(3)

         메뉴    가격  칼로리  원산지
5       밀크티  5900  210  NaN
6        녹차  5300    0  NaN
시즌  크리스마스라떼  6000  300   한국

In [8]:
# 딕셔너리 형태로 데이터(행) 추가
# 딕셔너리는 특정 컬럼이 없다면 결측치로 입력된다.
df.loc[7] = {'메뉴':'딴짓커피', '가격':2000, '칼로리':20}
df.tail(3)

         메뉴    가격  칼로리  원산지
6        녹차  5300    0  NaN
시즌  크리스마스라떼  6000  300   한국
7      딴짓커피  2000   20  NaN

In [9]:
df.drop("시즌", axis=0, inplace=True)
df.to_csv('cafe2.csv', index=False)

## Section10. 정렬

In [10]:
# 데이터 불러오기
df = pd.read_csv('cafe2.csv')
df.head(2)

      메뉴    가격  칼로리   원산지
0  아메리카노  4500   10  콜롬비아
1   카페라떼  5000  110   NaN

In [11]:
# 인덱스 기준 (기본값 ascending=True)
df.sort_index(ascending=False) # 내림차순

      메뉴    가격  칼로리   원산지
7   딴짓커피  2000   20   NaN
6     녹차  5300    0   NaN
5    밀크티  5900  210   NaN
4  에스프레소  4000   20   NaN
3   카푸치노  5000  110  과테말라
2   카페모카  5500  250  과테말라
1   카페라떼  5000  110   NaN
0  아메리카노  4500   10  콜롬비아

In [ ]:
# 값 기준 (기본값 ascending=True)
# 메뉴 기준 정렬
df.sort_values('메뉴',ascending=False)

In [12]:
# 가격과 메뉴 기준 정렬
# 순서에 맞게 리스트 형태로 대입한다.
df.sort_values(['가격', '메뉴'],ascending=[False, True], inplace=True)
df

      메뉴    가격  칼로리   원산지
5    밀크티  5900  210   NaN
2   카페모카  5500  250  과테말라
6     녹차  5300    0   NaN
1   카페라떼  5000  110   NaN
3   카푸치노  5000  110  과테말라
0  아메리카노  4500   10  콜롬비아
4  에스프레소  4000   20   NaN
7   딴짓커피  2000   20   NaN

In [13]:
# 인덱스 새로 만들기 drop=True
# 정렬된 상태로 인덱스를 0부터 새롭게 만든다.
# 만약 기존 인덱스가 필요없다면 drop=True로 설정한다.
df.reset_index(drop=True)

      메뉴    가격  칼로리   원산지
0    밀크티  5900  210   NaN
1   카페모카  5500  250  과테말라
2     녹차  5300    0   NaN
3   카페라떼  5000  110   NaN
4   카푸치노  5000  110  과테말라
5  아메리카노  4500   10  콜롬비아
6  에스프레소  4000   20   NaN
7   딴짓커피  2000   20   NaN

## Section11. 필터링

In [14]:
# 데이터 불러오기
df = pd.read_csv('cafe2.csv')
df.head(2)

      메뉴    가격  칼로리   원산지
0  아메리카노  4500   10  콜롬비아
1   카페라떼  5000  110   NaN

In [ ]:
# True, False가 반환된다.
df['칼로리'] < 50

In [ ]:
# 1개 조건
# True로 표시된 행들만 선택된다.
cond = df['칼로리'] < 50
df[cond]

In [ ]:
# 1개 조건
df[df['칼로리'] < 50]

In [ ]:
# NOT 연산자
cond = df['칼로리'] < 50
df[~cond]

In [ ]:
# 2개 이상 일때 (AND)
cond1 = df['가격'] >= 5000
cond2 = df['칼로리'] > 100
df[cond1 & cond2]

In [ ]:
# 2개 이상 일때 (OR)
df[cond1 | cond2]

In [ ]:
# 문자열 1개 조건
# 원두 == 콜롬비아
cond = (df['원산지'] == "과테말라")
df[cond]

In [ ]:
# 문자열과 숫자 조건 (AND)
cond1 = df['원산지'] == "과테말라"
cond2 = df['가격'] <= 5000
df[cond1 & cond2]

In [15]:
# 주어진 값이 있는지 확인
df['메뉴'].isin(['녹차'])

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
Name: 메뉴, dtype: bool

In [ ]:
cond = df['메뉴'].isin(['녹차'])
df[cond]

In [ ]:
# isin()은 주어진 값과의 완전한 일치를 검사한다.
box = ['녹차', '카푸치노', '카페라떼']
cond = df['메뉴'].isin(box)
df[cond]

## Section12. 결측치 처리

In [16]:
# 데이터 불러오기
df = pd.read_csv('cafe2.csv')
df.head(2)

      메뉴    가격  칼로리   원산지
0  아메리카노  4500   10  콜롬비아
1   카페라떼  5000  110   NaN

In [17]:
# 각 값마다 결측치가 있는지 True/False로 반환한다.
df.isnull()

      메뉴     가격    칼로리    원산지
0  False  False  False  False
1  False  False  False   True
2  False  False  False  False
3  False  False  False  False
4  False  False  False   True
5  False  False  False   True
6  False  False  False   True
7  False  False  False   True

In [18]:
# 컬럼별 결측치 확인
df.isnull().sum()

메뉴     0
가격     0
칼로리    0
원산지    5
dtype: int64

In [19]:
# 컬럼별 결측치 확인
df.isna().sum()

메뉴     0
가격     0
칼로리    0
원산지    5
dtype: int64

In [20]:
# 결측값 채우기
df['원산지'].fillna('코스타리카', inplace=True)
df

      메뉴    가격  칼로리    원산지
0  아메리카노  4500   10   콜롬비아
1   카페라떼  5000  110  코스타리카
2   카페모카  5500  250   과테말라
3   카푸치노  5000  110   과테말라
4  에스프레소  4000   20  코스타리카
5    밀크티  5900  210  코스타리카
6     녹차  5300    0  코스타리카
7   딴짓커피  2000   20  코스타리카

In [21]:
df.to_csv("cafe3.csv", index=False)

## Section13. 값 변경

In [22]:
# 데이터 확인
pd.read_csv("cafe3.csv")
df.head(3)

      메뉴    가격  칼로리    원산지
0  아메리카노  4500   10   콜롬비아
1   카페라떼  5000  110  코스타리카
2   카페모카  5500  250   과테말라

In [23]:
# 문자 변경 : 아메리카노 -> 룽고, 녹차 -> 그린티
df.replace('아메리카노', '룽고', inplace=True)
df.replace('녹차','그린티', inplace=True)
df

      메뉴    가격  칼로리    원산지
0     룽고  4500   10   콜롬비아
1   카페라떼  5000  110  코스타리카
2   카페모카  5500  250   과테말라
3   카푸치노  5000  110   과테말라
4  에스프레소  4000   20  코스타리카
5    밀크티  5900  210  코스타리카
6    그린티  5300    0  코스타리카
7   딴짓커피  2000   20  코스타리카

In [24]:
# 딕셔너리를 사용하여 한번에 바꿀 수 있다.
change = {'룽고':'아메리카노', '그린티':'녹차'}
df.replace(change, inplace=True)
df

      메뉴    가격  칼로리    원산지
0  아메리카노  4500   10   콜롬비아
1   카페라떼  5000  110  코스타리카
2   카페모카  5500  250   과테말라
3   카푸치노  5000  110   과테말라
4  에스프레소  4000   20  코스타리카
5    밀크티  5900  210  코스타리카
6     녹차  5300    0  코스타리카
7   딴짓커피  2000   20  코스타리카

In [25]:
# loc로 값 변경하기
df.loc[6, '원산지'] = '대한민국'
df.tail(3)

     메뉴    가격  칼로리    원산지
5   밀크티  5900  210  코스타리카
6    녹차  5300    0   대한민국
7  딴짓커피  2000   20  코스타리카

In [26]:
# 이벤트가 전체 1000으로 변경
# 새로운 컬럼을 만들고 값을 대입하지 않으면 자동으로 NaN이 들어간다.
df.loc[1:2, '이벤트가'] = 1000
df.head()

      메뉴    가격  칼로리    원산지    이벤트가
0  아메리카노  4500   10   콜롬비아     NaN
1   카페라떼  5000  110  코스타리카  1000.0
2   카페모카  5500  250   과테말라  1000.0
3   카푸치노  5000  110   과테말라     NaN
4  에스프레소  4000   20  코스타리카     NaN

In [27]:
df.to_csv("cafe4.csv", index=False)

## Section14. 문자열
문자열은 일련의 문자로 구성된 데이터 유형이다. 판다스에서는 str 접근자를 사용해 문자열 데이터를 효율적으로 다룰 수 있다. 아래 데이터는 의도적으로 제일 마지막에 공백 문자를 추가한 문자열을 저장하였다.

In [28]:
import pandas as pd
df = pd.DataFrame({'A': ['데이터 분석', '기본 학습서', '퇴근 후 열공'],
                   'B': [10, 20, 30],
                   'C': ['ab cd', 'AB CD', 'ab cd ']
                   })
df

         A   B       C
0   데이터 분석  10   ab cd
1   기본 학습서  20   AB CD
2  퇴근 후 열공  30  ab cd

In [29]:
# replace()는 '데이터 분석'이라는 문자열에서 '분석'이라는 일부 단어만 변경할 수는 없다.
df['A'] = df['A'].replace('분석', '시각화')
df

         A   B       C
0   데이터 분석  10   ab cd
1   기본 학습서  20   AB CD
2  퇴근 후 열공  30  ab cd

In [30]:
# 전체 문자열 중 일부만 변경할 때는 str을 사용한다.
# str 접근자를 활용하면 데이터프레임의 값을 문자열로 인식한다.
df['A'] = df['A'].str.replace('분석', '시각화')
df

         A   B       C
0  데이터 시각화  10   ab cd
1   기본 학습서  20   AB CD
2  퇴근 후 열공  30  ab cd

In [31]:
df['B'] = df['B'].replace(10, 100)
df

         A    B       C
0  데이터 시각화  100   ab cd
1   기본 학습서   20   AB CD
2  퇴근 후 열공   30  ab cd

In [251]:
# 에러
# 데이터가 숫자일 때는 str 접근자를 사용할 수 없다.
# df['B'] = df['B'].str.replace(20, 200)
# print(df)

In [32]:
# 문자열 분리 - 기본적으로 띄어쓰기를 기준으로 분리한다.
df['A'].str.split()

0     [데이터, 시각화]
1      [기본, 학습서]
2    [퇴근, 후, 열공]
Name: A, dtype: object

In [33]:
# 첫 번째 행을 선택
df['A'].str.split()[0]

['데이터', '시각화']

In [34]:
# 분리 후 첫 번째 단어만 선택한다.
# str.split()은 문자열을 리스트로 나눠 시리즈 자료형으로 반환하고,
# str[0]은 각 리스트의 첫번째 값을 선택한다.
df['D'] = df['A'].str.split().str[0]
df

         A    B       C    D
0  데이터 시각화  100   ab cd  데이터
1   기본 학습서   20   AB CD   기본
2  퇴근 후 열공   30  ab cd    퇴근

In [35]:
# 문자 검색

# isin()은 특정 값이 있는지 확인한다. 
# 괄호 안에는 리스트 형태로 데이터가 입력된다. 여러 개의 값을 찾을 수 있다. = 필터링

# contains()는 값을 찾거나 값의 일부를 찾는다. 
# 즉 특정 단어가 포함되어 있는지 확인할 수 있다. 
# str을 통해 접근한다. 찾고자 하는 1개 값만 입력값으로 대입할 수 있다.

df['A'].str.contains('기본')

0    False
1     True
2    False
Name: A, dtype: bool

In [36]:
df['기본포함유무'] = df['A'].str.contains('기본')
df

         A    B       C    D  기본포함유무
0  데이터 시각화  100   ab cd  데이터   False
1   기본 학습서   20   AB CD   기본    True
2  퇴근 후 열공   30  ab cd    퇴근   False

In [37]:
menu = pd.Series(['맛난버거 세트', '매운 치킨버거', '더블 치즈버거'])
menu.isin(['맛난버거 세트', '더블 치즈버거'])

0     True
1    False
2     True
dtype: bool

In [38]:
menu.str.contains('세트')

0     True
1    False
2    False
dtype: bool

In [39]:
df['문자길이'] = df['A'].str.len()
df

         A    B       C    D  기본포함유무  문자길이
0  데이터 시각화  100   ab cd  데이터   False     7
1   기본 학습서   20   AB CD   기본    True     6
2  퇴근 후 열공   30  ab cd    퇴근   False     7

In [ ]:
# 파이썬은 대소문자를 구분한다.
'AB cd' == 'ab CD'

In [40]:
# 소문자로 변경
df['C'] = df['C'].str.lower()
df['C']

0     ab cd
1     ab cd
2    ab cd
Name: C, dtype: object

In [41]:
# 대문자로 변경
df['C'] = df['C'].str.upper()
df['C']

0     AB CD
1     AB CD
2    AB CD
Name: C, dtype: object

In [42]:
# 문자열 마지막에 공백 문자를 의도적으로 추가했기 때문에 2번 행에서 False가 난다.
df['C'] == 'AB CD'

0     True
1     True
2    False
Name: C, dtype: bool

In [43]:
# 문제에서 특정 영문 단어의 수를 물었을 때, 특정 단어의 대소문자가 다를수도 있고 공백이 포함되어 있을 수 있다.
# 그래서 소문자로 변경하고 공백도 제거하는 전처리가 필요하다!
df['C'] = df['C'].str.lower()
df['C'] = df['C'].str.replace(" ","")
df['C']

0    abcd
1    abcd
2    abcd
Name: C, dtype: object

In [ ]:
# 양쪽 공백 제거
df['C'].str.strip()

In [ ]:
# 왼쪽 공백 제거
df['C'].str.lstrip()

In [ ]:
# 오른쪽 공백 제거
df['C'] = df['C'].str.rstrip()
df['C'] == 'ab cd'

In [ ]:
df['C'].str[1:3]

In [ ]:
df['C'][1:3]

## Section15. 내장함수
- 데이터 핸들링을 위한 판다스 기초1(EDA) 부분에서 일부 내장함수를 학습했고, 그외 함수에 대해 살펴봄

In [44]:
df = pd.read_csv("cafe4.csv")
df.head(2)

      메뉴    가격  칼로리    원산지    이벤트가
0  아메리카노  4500   10   콜롬비아     NaN
1   카페라떼  5000  110  코스타리카  1000.0

In [ ]:
print(len(df)) # 리스트에서 데이터의 수를 반환, 데이터프레임에서 행의 수를 반환
print(df.shape[0]) # 또는 shape를 사용할 수 있음

In [ ]:
# cond는 True, False를 반환하므로 sum으로 그 개수를 셀 수 있다.
cond = df['가격'] > 5000

#sum으로 조건에 맞는 개수 구하기
print(sum(cond))

#len으로 조건에 맞는 개수 구하기
print(len(df[cond]))

In [ ]:
# sum은 기본적으로 컬럼별 합계를 구한다.
df.sum(numeric_only=True)

In [ ]:
# 행별 합계를 구할 땐, axis를 1로 변경한다.
# sum에서는 0이 컬럼별 합계이고, 1이 행별 합계이다.
df.sum(axis=1, numeric_only=True)

In [45]:
# 행과 열을 변경한다. Transpose
df.T

          0       1       2     3      4      5     6      7
메뉴    아메리카노    카페라떼    카페모카  카푸치노  에스프레소    밀크티    녹차   딴짓커피
가격     4500    5000    5500  5000   4000   5900  5300   2000
칼로리      10     110     250   110     20    210     0     20
원산지    콜롬비아   코스타리카    과테말라  과테말라  코스타리카  코스타리카  대한민국  코스타리카
이벤트가    NaN  1000.0  1000.0   NaN    NaN    NaN   NaN    NaN

In [ ]:
print("최대값: ",df['가격'].max())
print("최소값: ",df['가격'].min())
print("평균값: ",df['가격'].mean())
print("중앙값: ",df['가격'].median())
print("합계: ",df['가격'].sum())
print("표준편차: ",df['가격'].std())
print("분산: ",df['가격'].var())

In [ ]:
# 분위수
print("분위수 25% 값", df['가격'].quantile(.25))
print("분위수 75% 값", df['가격'].quantile(.75))

In [ ]:
# 하위 25% 데이터
cond = df['가격'].quantile(.25) > df['가격']
df[cond]

In [ ]:
# 상위 25% 데이터
cond = df['가격'].quantile(.75) < df['가격']
df[cond]

In [ ]:
# 최빈값 구하기 : mode()는 시리즈 형태로 반환한다. 그래서 인덱스 제외한 값을 얻고 싶다면 [0]을 쓰자
df['원산지'].mode()[0]

In [ ]:
# 최댓값, 최솟값을 갖는 인덱스
df['가격'].idxmax() # 가격이 가장 큰 값의 인덱스
df['가격'].idxmin() # 가격이 가장 작은 값의 인덱스

In [ ]:
max_ind = df['가격'].idxmax()
df.loc[max_ind]

In [ ]:
# 가장 높은 가격의 메뉴를 찾을 때
# df.loc[max_ind, '메뉴'] # 추천 방법
df.loc[max_ind]['메뉴'] # 다른 방법

In [ ]:
# 가격 컬럼 중에 큰 값 순으로 3개 반환
df.nlargest(3, '가격')

In [ ]:
# 가격 컬럼 중에 작은 값 순으로 2개 반환
df.nsmallest(2, '가격')

In [ ]:
# apply 적용해서 새로운 컬럼 생성 (칼로리 컬럼 활용)
def cal(x):
    if x >= 100:
        return "No"
    else:
        return "Yes"

df['먹어도 될까요'] = df['칼로리'].apply(cal)
df

In [46]:
# melt() 데이터프레임을 재구조화
# 넓은 형태(wide format)의 데이터를 긴 형태(long format)의 데이터로 변환
import pandas as pd
df = pd.DataFrame({'Name': {0: '쿼카', 1: '알파카', 2: '시바견'},
                   '수학': {0: 90, 1: 93, 2: 85},
                   '영어': {0: 92, 1: 84, 2: 86},
                   '국어': {0: 91, 1: 94, 2: 83},})

df # 넓은 형태의 데이터 : 각 행이 한 사람의 모든 정보를 담고 있고, 열이 다양한 변수(과목)을 나타낸다.

  Name  수학  영어  국어
0   쿼카  90  92  91
1  알파카  93  84  94
2  시바견  85  86  83

In [47]:
# 긴 형태의 데이터로 변환한다.
# 긴 형태란 각 행이 단 하나의 관측값만을 갖고, 다양한 변수들이 행으로 길게 나열되는 형태를 말한다.
# id_vars(필수): 데이터를 재구조화할 때 유지하고 싶은 열들을 지정
# value_vars(선택): 재구조화할 열을 지정
pd.melt(df, id_vars=['Name'])

  Name variable  value
0   쿼카       수학     90
1  알파카       수학     93
2  시바견       수학     85
3   쿼카       영어     92
4  알파카       영어     84
5  시바견       영어     86
6   쿼카       국어     91
7  알파카       국어     94
8  시바견       국어     83

In [48]:
# value_vars에 지정한 컬럼만 긴 형태로 변형된다.
pd.melt(df, id_vars=['Name'], value_vars=['수학', '영어'])

  Name variable  value
0   쿼카       수학     90
1  알파카       수학     93
2  시바견       수학     85
3   쿼카       영어     92
4  알파카       영어     84
5  시바견       영어     86

## Section16. 그룹핑
특정 컬럼을 기준으로 여러 그룹을 나누고, 각 그룹에 대해 합계, 평균, 최대, 최소, 빈도 등을 구할 수 있다.

In [49]:
df = pd.read_csv("cafe4.csv")
df.head(2)

      메뉴    가격  칼로리    원산지    이벤트가
0  아메리카노  4500   10   콜롬비아     NaN
1   카페라떼  5000  110  코스타리카  1000.0

In [50]:
# 원두 기준, 평균
# 원산지를 기준으로 그룹이 만들어진다.
# numeric 옵션에 의해 평균을 구할 수 있는 컬럼만 구한다.
df.groupby('원산지').mean(numeric_only=True)

           가격    칼로리    이벤트가
원산지
과테말라   5250.0  180.0  1000.0
대한민국   5300.0    0.0     NaN
코스타리카  4225.0   90.0  1000.0
콜롬비아   4500.0   10.0     NaN

In [ ]:
# 원두와 할인율 기준, 평균
# 그룹 기준이 2개 이상일 경우, 대괄호로 감싼다.
df.groupby(['원산지', '칼로리']).mean(numeric_only=True)

In [ ]:
# agg() : 다양한 집계 연산을 동시에 수행
df.groupby(['원산지', '메뉴']).agg(['mean', 'sum'])

In [ ]:
# 1개 인덱스 형태로 리셋
df.groupby(['원산지', '칼로리']).mean(numeric_only=True).reset_index()

## Section17. 시계열 데이터 (Datetime)

In [51]:
import pandas as pd
data = {
    'Date1': ['2024-02-17', '2024-02-18', '2024-02-19', '2024-02-20'],
    'Date2': ['2024:02:17', '2024:02:18', '2024:02:19', '2024:02:20'],
    'Date3': ['24/02/17', '24/02/18', '24/02/19', '24/02/20'],
    'Date4': ['02/17/2024', '02/18/2024', '02/19/2024', '02/20/2024'],
    'Date5': ['17-Feb-2024', '18-Feb-2024', '19-Feb-2024', '20-Feb-2024'],
    'DateTime1': ['24-02-17 13:45:30', '24-02-18 14:55:45', '24-02-19 15:30:15', '24-02-20 16:10:50'],
    'DateTime2': ['2024-02-17 13-45-30', '2024-02-18 14-55-45', '2024-02-19 15-30-15', '2024-02-20 16-10-50'],
    'DateTime3': ['02/17/2024 01:45:30 PM', '02/18/2024 02:55:45 PM', '02/19/2024 03:30:15 AM', '02/20/2024 04:10:50 AM'],
    'DateTime4': ['17 Feb 2024 13:45:30', '18 Feb 2024 14:55:45', '19 Feb 2024 15:30:15', '20 Feb 2024 16:10:50']
}

df = pd.DataFrame(data)
df.to_csv("date_data.csv", index=False)
df

,Date1,Date2,Date3,Date4,Date5,DateTime1,DateTime2,DateTime3,DateTime4
0,2024-02-17,2024:02:17,24/02/17,02/17/2024,17-Feb-2024,24-02-17 13:45:30,2024-02-17 13-45-30,02/17/2024 01:45:30 PM,17 Feb 2024 13:45:30
1,2024-02-18,2024:02:18,24/02/18,02/18/2024,18-Feb-2024,24-02-18 14:55:45,2024-02-18 14-55-45,02/18/2024 02:55:45 PM,18 Feb 2024 14:55:45
2,2024-02-19,2024:02:19,24/02/19,02/19/2024,19-Feb-2024,24-02-19 15:30:15,2024-02-19 15-30-15,02/19/2024 03:30:15 AM,19 Feb 2024 15:30:15
3,2024-02-20,2024:02:20,24/02/20,02/20/2024,20-Feb-2024,24-02-20 16:10:50,2024-02-20 16-10-50,02/20/2024 04:10:50 AM,20 Feb 2024 16:10:50

In [ ]:
# 파이썬은 데이터를 불러올 때 날짜와 시간을 자동으로 인식하지 못한다.
# 그래서 문자열 데이터로 인식해 자료형은 object인 것을 확인할 수 있다.
df.info()

In [ ]:
# pd.to_datetime(df['컬럼명'])
# object에서 datetime으로 자료형을 변경한다.(parsing)
# 대부분의 날짜와 시간 형태는 판다스가 자동으로 인식해 변경한다.
# 제대로 인식하지 못할 때는 format 설정이 별도로 필요하다.
df = pd.read_csv("date_data.csv")
df['Date1'] = pd.to_datetime(df['Date1'])
df['Date2'] = pd.to_datetime(df['Date2'], format='%Y:%m:%d')
df['Date3'] = pd.to_datetime(df['Date3'])
df['Date4'] = pd.to_datetime(df['Date4'])
df['Date5'] = pd.to_datetime(df['Date5'])
df['DateTime1'] = pd.to_datetime(df['DateTime1'])
df['DateTime2'] = pd.to_datetime(df['DateTime2'], format='%Y-%m-%d %H-%M-%S')
df['DateTime3'] = pd.to_datetime(df['DateTime3'])
df['DateTime4'] = pd.to_datetime(df['DateTime4'])
df
# Date3와 DateTime1은 에러가 발생하지는 않지만 연도, 월, 일을 잘못 인식했다.
# Date2와 DateTime2는 에러가 발생해 format을 미리 설정했다.

In [ ]:
df = pd.read_csv("date_data.csv")
df['Date2'] = pd.to_datetime(df['Date2'], format='%Y:%m:%d')
df['Date3'] = pd.to_datetime(df['Date3'], format='%y/%m/%d')
df['DateTime1'] = pd.to_datetime(df['DateTime1'], format='%y-%m-%d %H:%M:%S')
df['DateTime2'] = pd.to_datetime(df['DateTime2'], format='%Y-%m-%d %H-%M-%S')
df[['Date2', 'Date3', 'DateTime1', 'DateTime2']]

In [ ]:
# df[['Date2', 'Date3', 'DateTime1', 'DateTime2']] 또는
cols = ['Date2', 'Date3', 'DateTime1', 'DateTime2']
df[cols]

In [ ]:
df.info()

In [ ]:
# dateTime 자료형은 dt를 활용하여 연도, 월, 일, 시간, 분, 초를 별도의 변수로 분리할 수 있다.
df['year'] = df['DateTime1'].dt.year
df['month'] = df['DateTime1'].dt.month
df['day'] = df['DateTime1'].dt.day
df['hour'] = df['DateTime1'].dt.hour
df['minute'] = df['DateTime1'].dt.minute
df['second'] = df['DateTime1'].dt.second
df

In [ ]:
# 해당 날짜의 요일을 숫자로 변경한 값을 반환한다.
# 월0, 화1, ..., 토5, 일6
df['DateTime1'].dt.dayofweek

In [ ]:
# dateTime은 특정 날짜와 시간을 나타낸다.
# period는 특정 시간의 범위나 구간을 나타낸다.
print(df['DateTime1'].dt.to_period('Y')) # 연도
print(df['DateTime1'].dt.to_period('Q')) # 분기
print(df['DateTime1'].dt.to_period('M')) # 월
print(df['DateTime1'].dt.to_period('D')) # 일
print(df['DateTime1'].dt.to_period('H')) # 시간

## Section18. 시계열 데이터 (Timedelta)
DateTime은 특정 시점의 날짜와 시간을 나타내고, Timedelta는 두 시점 사이의 차이를 나타낸다. 날짜와 시간을 더하거나 빼서 새로운 시점을 계산할 수 있다. dateTime 자료형을 빼거나 더하면 결과값으로 Timedelta 자료형이 된다.

In [ ]:
# parse_dates를 사용해 datetime 자료형으로 변환
df = pd.read_csv("date_data.csv", usecols=['DateTime4'], parse_dates=['DateTime4'])
df

In [ ]:
day = pd.Timedelta(days=99)
df['100day'] = df['DateTime4'] + day
df

In [ ]:
hour = pd.Timedelta(hours=100)
df['100hour'] = df['DateTime4'] + hour
df

In [ ]:
# 7주 7일 7시간 7분 7초 이전
difference = pd.Timedelta(weeks=7, days=7, hours=7, minutes=7, seconds=7)
df['difference'] = df['DateTime4'] - difference
df

In [ ]:
diff = df['100hour'] - df['difference']
diff

In [ ]:
# dt.total_seconds(): 전체 시간을 초 단위로 변경한다.
print(diff.dt.total_seconds()) # 초
print(diff.dt.total_seconds()/60) # 분
print(diff.dt.total_seconds()/60/60) # 시간
print(diff.dt.total_seconds()/60/60/24) # 일

In [ ]:
print(diff.dt.days)
print(diff.dt.seconds) # 총 시간에서 일을 제외한 초를 반환 = 11시 7분 7초를 초로 반환

In [ ]:
min = 5.41 # 5분과 0.41분의 합
print(int(min), "분")
print(0.41*60, "초")
# 5.41분은 실제로 5*60 + 24.6초이다.
# 1.0분은 60초, 0.5분은 30초이다.

In [ ]:
print(round(diff.dt.total_seconds()/60))

## Section19. 데이터 합치기

In [ ]:
import pandas as pd

# 에피타이저 메뉴
appetizer = pd.DataFrame({
    'Menu': ['Salad', 'Soup', 'Bread'],
    'Price': [5000, 3000, 2000]
})

# 메인 메뉴
main = pd.DataFrame({
    'Menu': ['Steak', 'Pasta', 'Chicken'],
    'Price': [15000, 12000, 10000]
})
print(appetizer)
print(main)

In [ ]:
# 두 메뉴를 수직으로 연결 : default 수직(axis=0)
full_menu = pd.concat([appetizer, main], ignore_index=True)
full_menu

In [ ]:
# 두 메뉴를 좌우로 연결
full_menu = pd.concat([appetizer, main], axis=1)
full_menu

In [ ]:
# 메뉴와 가격
price = pd.DataFrame({
    'Menu': ['Salad', 'Soup', 'Steak', 'Pasta'],
    'Price': [5000, 3000, 15000, 12000]
})

# 메뉴와 칼로리
cal = pd.DataFrame({
    'Menu': ['Soup', 'Steak', 'Pasta','Salad'],
    'Calories': [100, 500, 400, 150]
})

# 두 데이터프레임을 'Menu'를 기준으로 병합
menu_info = pd.merge(price, cal, on='Menu')
menu_info

## Section20.Quiz

In [ ]:
# 데이터 불러오기
import pandas as pd
import numpy as np

df = pd.DataFrame({
    "메뉴":['아메리카노', '카페라떼', '에스프레소', '카페모카', '바닐라라떼'],
    "가격":[4500, 5000, 4000, 5900, 5300],
    "칼로리":[10, 110, np.NaN, 210, np.NaN],
    "원산지":['과테말라','브라질','과테말라', np.NaN, np.NaN]
})
df

**1. '칼로리' 컬럼 결측치는 칼로리 데이터 중 최소값으로 결측치를 채우시오**

In [ ]:
min_cal = df['칼로리'].min()
df['칼로리'] = df['칼로리'].fillna(min_cal)
df

**2. '원산지' 컬럼 결측치는 원두 데이터 중 최빈값으로 결측치를 채우시오**

In [ ]:
f = df['원산지'].mode()[0]
df['원산지'] = df['원산지'].fillna(f)
df

**3. 가격이 5000 이상인 데이터의 수를 구하시오**

In [ ]:
cond = df['가격'] >= 5000
len(df[cond]) # 또는 sum(cond)

**4. ’이벤트가’ 컬럼을 만들고 기존 가격에서 50% 할인된 가격을 채우시오**

In [ ]:
df['이벤트가'] = df['가격'] * 0.5
df

**5. '칼로리' 컬럼을 삭제하시오**

In [ ]:
df = df.drop('칼로리', axis=1)
df

**6. 앞에서부터 3개의 데이터만 선택하시오(loc 활용)**

In [ ]:
df.loc[:2]

**7. 앞에서부터 3개의 데이터만 선택하시오(iloc 활용)**

In [ ]:
df.iloc[:3]

**8. 주어진 데이터(df)에서 아래 값을 loc를 활용해 데이터 프레임으로 출력하시오**
- 카페라떼	5000
- 에스프레소 4000

In [ ]:
# loc
df.loc[1:2, :'가격']

**9. 주어진 데이터(df)에서 아래 값을 iloc를 활용해 데이터 프레임으로 출력하시오**
- 카페라떼	5000
- 에스프레소 4000

In [ ]:
# iloc
df.iloc[1:3, :2]

**10. 메뉴 중 가격이 가장 비싼 순으로 정렬해 상위 3개 값을 구하시오**

In [ ]:
df = df.sort_values('가격', ascending=False)
df.iloc[:3]